[Killed] ConditionalExpression
routes/generator/generate_info.js:7:29
 import fs from 'fs/promises';
 import path from 'path';
 
-const TITLE_AND_ALBUM_MAX = parseInt(process.env.TITLE_ALBUM_MAX) || 3;
+const TITLE_AND_ALBUM_MAX = false;
 const TITLE_AND_ALBUM_MIN = parseInt(process.env.TITLE_ALBUM_MIN) || 1;
 
killedBy: generateInfo Fallback logic - album generation should respect TITLE_AND_ALBUM_MIN and TITLE_AND_ALBUM_MAX environment variables
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"max": Any<Number>, "min": Any<Number>}
Received
       1: {"max": false, "min": 1}
       2: {"max": false, "min": 1}

Number of calls: 2

[Killed] ConditionalExpression
routes/generator/generate_info.js:7:29
 import fs from 'fs/promises';
 import path from 'path';
 
-const TITLE_AND_ALBUM_MAX = parseInt(process.env.TITLE_ALBUM_MAX) || 3;
+const TITLE_AND_ALBUM_MAX = true;
 const TITLE_AND_ALBUM_MIN = parseInt(process.env.TITLE_ALBUM_MIN) || 1;
 
killedBy: generateInfo Fallback logic - album generation should respect TITLE_AND_ALBUM_MIN and TITLE_AND_ALBUM_MAX environment variables
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"max": Any<Number>, "min": Any<Number>}
Received
       1: {"max": true, "min": 1}
       2: {"max": true, "min": 1}

Number of calls: 2

[Killed] ConditionalExpression
routes/generator/generate_info.js:8:29
 import path from 'path';
 
 const TITLE_AND_ALBUM_MAX = parseInt(process.env.TITLE_ALBUM_MAX) || 3;
-const TITLE_AND_ALBUM_MIN = parseInt(process.env.TITLE_ALBUM_MIN) || 1;
+const TITLE_AND_ALBUM_MIN = true;
 
 export async function generateInfo(fakerInstance, seed, page) {
killedBy: generateInfo Fallback logic - album generation should respect TITLE_AND_ALBUM_MIN and TITLE_AND_ALBUM_MAX environment variables
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"max": Any<Number>, "min": Any<Number>}
Received
       1: {"max": 3, "min": true}
       2: {"max": 3, "min": true}

Number of calls: 2

[Killed] ConditionalExpression
routes/generator/generate_info.js:8:29
 import path from 'path';
 
 const TITLE_AND_ALBUM_MAX = parseInt(process.env.TITLE_ALBUM_MAX) || 3;
-const TITLE_AND_ALBUM_MIN = parseInt(process.env.TITLE_ALBUM_MIN) || 1;
+const TITLE_AND_ALBUM_MIN = false;
 
 export async function generateInfo(fakerInstance, seed, page) {
killedBy: generateInfo Fallback logic - album generation should respect TITLE_AND_ALBUM_MIN and TITLE_AND_ALBUM_MAX environment variables
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"max": Any<Number>, "min": Any<Number>}
Received
       1: {"max": 3, "min": false}
       2: {"max": 3, "min": false}

Number of calls: 2

[Killed] BlockStatement
routes/generator/generate_info.js:12:9
 
 export async function generateInfo(fakerInstance, seed, page) {
     let artist;
-    try {
-        artist = fakerInstance.music.artist();
-    } catch {
+    try {} catch {
         const person = fakerInstance.person.fullName() || 'Unknown';
         const nameParts = person.split(' ');
killedBy: generateInfo Happy path - all faker methods work should generate complete music info with all faker methods working
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "album": "Abbey Road",
-   "artist": "The Beatles",

[Killed] BlockStatement
routes/generator/generate_info.js:14:13
     let artist;
     try {
         artist = fakerInstance.music.artist();
-    } catch {
-        const person = fakerInstance.person.fullName() || 'Unknown';
-        const nameParts = person.split(' ');
-        const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
-        const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
-        const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());
-        const companyName = companyWords.map(w => w[0].toUpperCase() + w.slice(1)).join(' ');
-        artist = `${chosenName} ${companyName}`;
-    }
+    } catch {}
 
     const countAlbum = fakerInstance.number.int({ min: TITLE_AND_ALBUM_MIN, max: TITLE_AND_ALBUM_MAX });
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] LogicalOperator
routes/generator/generate_info.js:15:24
     try {
         artist = fakerInstance.music.artist();
     } catch {
-        const person = fakerInstance.person.fullName() || 'Unknown';
+        const person = fakerInstance.person.fullName() && 'Unknown';
         const nameParts = person.split(' ');
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^(John|Smith) Studio Records$/
Received string:  "Unknown Studio Records"

[Killed] ConditionalExpression
routes/generator/generate_info.js:15:24
     try {
         artist = fakerInstance.music.artist();
     } catch {
-        const person = fakerInstance.person.fullName() || 'Unknown';
+        const person = true;
         const nameParts = person.split(' ');
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: TypeError: person.split is not a function

[Killed] StringLiteral
routes/generator/generate_info.js:16:40
         artist = fakerInstance.music.artist();
     } catch {
         const person = fakerInstance.person.fullName() || 'Unknown';
-        const nameParts = person.split(' ');
+        const nameParts = person.split("");
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^(John|Smith) Studio Records$/
Received string:  "J Studio Records"

[Killed] ArithmeticOperator
routes/generator/generate_info.js:17:75
     } catch {
         const person = fakerInstance.person.fullName() || 'Unknown';
         const nameParts = person.split(' ');
-        const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
+        const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length + 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
         const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());
killedBy: generateInfo Edge cases should handle single-word person names in fallback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Madonna Music"
Received: "undefined Music"

[Survived] EqualityOperator
routes/generator/generate_info.js:17:28
     } catch {
         const person = fakerInstance.person.fullName() || 'Unknown';
         const nameParts = person.split(' ');
-        const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
+        const chosenName = Math.random() <= 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
         const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());

[Killed] ArrowFunction
routes/generator/generate_info.js:19:64
         const nameParts = person.split(' ');
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
-        const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());
+        const companyWords = Array.from({ length: wordCount }, () => undefined);
         const companyName = companyWords.map(w => w[0].toUpperCase() + w.slice(1)).join(' ');
         artist = `${chosenName} ${companyName}`;
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
routes/generator/generate_info.js:20:46
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
         const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());
-        const companyName = companyWords.map(w => w[0].toUpperCase() + w.slice(1)).join(' ');
+        const companyName = companyWords.map(() => undefined).join(' ');
         artist = `${chosenName} ${companyName}`;
     }
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^(John|Smith) Studio Records$/
Received string:  "Smith  "

[Killed] ArithmeticOperator
routes/generator/generate_info.js:20:51
         const chosenName = Math.random() < 0.5 ? nameParts[0] : nameParts[nameParts.length - 1];
         const wordCount = fakerInstance.number.int({ min: 1, max: 2 });
         const companyWords = Array.from({ length: wordCount }, () => fakerInstance.word.noun());
-        const companyName = companyWords.map(w => w[0].toUpperCase() + w.slice(1)).join(' ');
+        const companyName = companyWords.map(w => w[0].toUpperCase() - w.slice(1)).join(' ');
         artist = `${chosenName} ${companyName}`;
     }
killedBy: generateInfo Fallback logic - artist generation should generate artist from person name when music.artist throws
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^(John|Smith) Studio Records$/
Received string:  "Smith NaN NaN"

[Killed] BlockStatement
routes/generator/generate_info.js:26:9
 
     const countAlbum = fakerInstance.number.int({ min: TITLE_AND_ALBUM_MIN, max: TITLE_AND_ALBUM_MAX });
     let album;
-    try {
-        album = fakerInstance.music.album();
-    } catch {
+    try {} catch {
         album =
             Array.from({ length: countAlbum }, () => fakerInstance.word.noun()).join(' ') ||
killedBy: generateInfo Happy path - all faker methods work should generate complete music info with all faker methods working
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "album": "Abbey Road",

[Killed] BlockStatement
routes/generator/generate_info.js:28:13
     let album;
     try {
         album = fakerInstance.music.album();
-    } catch {
-        album =
-            Array.from({ length: countAlbum }, () => fakerInstance.word.noun()).join(' ') ||
-            'Unknown Album';
-    }
+    } catch {}
 
     let genre;
killedBy: generateInfo Fallback logic - album generation should generate album from nouns when music.album throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "summer night dreams"
Received: undefined

[Killed] ArrowFunction
routes/generator/generate_info.js:30:48
         album = fakerInstance.music.album();
     } catch {
         album =
-            Array.from({ length: countAlbum }, () => fakerInstance.word.noun()).join(' ') ||
+            Array.from({ length: countAlbum }, () => undefined).join(' ') ||
             'Unknown Album';
     }
killedBy: generateInfo Fallback logic - album generation should generate album from nouns when music.album throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "summer night dreams"
Received: "  "

[Killed] ConditionalExpression
routes/generator/generate_info.js:30:13
         album = fakerInstance.music.album();
     } catch {
         album =
-            Array.from({ length: countAlbum }, () => fakerInstance.word.noun()).join(' ') ||
-            'Unknown Album';
+            true;
     }
 
killedBy: generateInfo Fallback logic - album generation should generate album from nouns when music.album throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "summer night dreams"
Received: true

[NoCoverage] StringLiteral
routes/generator/generate_info.js:31:13
     } catch {
         album =
             Array.from({ length: countAlbum }, () => fakerInstance.word.noun()).join(' ') ||
-            'Unknown Album';
+            "";
     }
 

[Killed] BlockStatement
routes/generator/generate_info.js:35:9
     }
 
     let genre;
-    try {
-        genre = fakerInstance.music.genre();
-    } catch {
+    try {} catch {
         genre = fakerInstance.word.adjective() || 'Unknown Genre';
     }
killedBy: generateInfo Happy path - all faker methods work should generate complete music info with all faker methods working
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "album": "Abbey Road",
    "artist": "The Beatles",

[Killed] BlockStatement
routes/generator/generate_info.js:37:13
     let genre;
     try {
         genre = fakerInstance.music.genre();
-    } catch {
-        genre = fakerInstance.word.adjective() || 'Unknown Genre';
-    }
+    } catch {}
 
     const countTitle = fakerInstance.number.int({ min: TITLE_AND_ALBUM_MIN, max: TITLE_AND_ALBUM_MAX });
killedBy: generateInfo Fallback logic - genre generation should generate genre from adjective when music.genre throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "electronic"
Received: undefined

[Killed] ConditionalExpression
routes/generator/generate_info.js:38:17
     try {
         genre = fakerInstance.music.genre();
     } catch {
-        genre = fakerInstance.word.adjective() || 'Unknown Genre';
+        genre = true;
     }
 
killedBy: generateInfo Fallback logic - genre generation should generate genre from adjective when music.genre throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "electronic"
Received: true

[Killed] ConditionalExpression
routes/generator/generate_info.js:38:17
     try {
         genre = fakerInstance.music.genre();
     } catch {
-        genre = fakerInstance.word.adjective() || 'Unknown Genre';
+        genre = false;
     }
 
killedBy: generateInfo Fallback logic - genre generation should generate genre from adjective when music.genre throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "electronic"
Received: false

[Killed] BlockStatement
routes/generator/generate_info.js:43:9
 
     const countTitle = fakerInstance.number.int({ min: TITLE_AND_ALBUM_MIN, max: TITLE_AND_ALBUM_MAX });
     let title;
-    try {
-        title = fakerInstance.music.songName();
-    } catch {
+    try {} catch {
         title = fakerInstance.word.words(countTitle) || 'Untitled';
     }
killedBy: generateInfo Happy path - all faker methods work should generate complete music info with all faker methods working
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] BlockStatement
routes/generator/generate_info.js:45:13
     let title;
     try {
         title = fakerInstance.music.songName();
-    } catch {
-        title = fakerInstance.word.words(countTitle) || 'Untitled';
-    }
+    } catch {}
 
     const company = fakerInstance.company.name();
killedBy: generateInfo Fallback logic - title generation should generate title from words when music.songName throws
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] LogicalOperator
routes/generator/generate_info.js:46:17
     try {
         title = fakerInstance.music.songName();
     } catch {
-        title = fakerInstance.word.words(countTitle) || 'Untitled';
+        title = fakerInstance.word.words(countTitle) && 'Untitled';
     }
 
killedBy: generateInfo Fallback logic - title generation should generate title from words when music.songName throws
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "amazing beautiful melody"
Received: "Untitled"

[Killed] ConditionalExpression
routes/generator/generate_info.js:46:17
     try {
         title = fakerInstance.music.songName();
     } catch {
-        title = fakerInstance.word.words(countTitle) || 'Untitled';
+        title = true;
     }
 
killedBy: generateInfo Fallback logic - title generation should generate title from words when music.songName throws
statusReason: TypeError: info.title.toUpperCase is not a function

[Killed] ObjectLiteral
routes/generator/generate_info.js:52:18
     const company = fakerInstance.company.name();
     const image = fakerInstance.image.avatarGitHub(); 
 
-    const info = { artist, company, album, genre, title, image };
+    const info = {};
     const imagePath = await createImageWithTitle(info, seed, page);
 
killedBy: generateInfo Happy path - all faker methods work should generate complete music info with all faker methods working
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Survived] StringLiteral
routes/generator/generate_info.js:66:21
 
     const baseImage = await loadImage(info.image);
     ctx.drawImage(baseImage, 0, 0, width, height);
-    ctx.fillStyle = 'rgba(0,0,0,0.5)';
+    ctx.fillStyle = "";
     ctx.fillRect(0, 0, width, height);
 

[Survived] MethodExpression
routes/generator/generate_info.js:69:19
     ctx.fillStyle = 'rgba(0,0,0,0.5)';
     ctx.fillRect(0, 0, width, height);
 
-    const words = info.title.toUpperCase().split(' ');
+    const words = info.title.toLowerCase().split(' ');
 
     const minFont = 40;

[Survived] StringLiteral
routes/generator/generate_info.js:69:50
     ctx.fillStyle = 'rgba(0,0,0,0.5)';
     ctx.fillRect(0, 0, width, height);
 
-    const words = info.title.toUpperCase().split(' ');
+    const words = info.title.toUpperCase().split("");
 
     const minFont = 40;

[Survived] ArrowFunction
routes/generator/generate_info.js:73:31
 
     const minFont = 40;
     const maxFont = 160;
-    let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
+    let wordSizes = words.map(() => undefined);
 
     const lineHeights = wordSizes.map(size => size * 1.2);

[Survived] MethodExpression
routes/generator/generate_info.js:73:39
 
     const minFont = 40;
     const maxFont = 160;
-    let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
+    let wordSizes = words.map(word => Math.min(minFont, maxFont - word.length * 5));
 
     const lineHeights = wordSizes.map(size => size * 1.2);

[Survived] ArithmeticOperator
routes/generator/generate_info.js:75:47
     const maxFont = 160;
     let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
 
-    const lineHeights = wordSizes.map(size => size * 1.2);
+    const lineHeights = wordSizes.map(size => size / 1.2);
     const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
 

[Survived] ArrowFunction
routes/generator/generate_info.js:75:39
     const maxFont = 160;
     let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
 
-    const lineHeights = wordSizes.map(size => size * 1.2);
+    const lineHeights = wordSizes.map(() => undefined);
     const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
 

[Survived] ArithmeticOperator
routes/generator/generate_info.js:76:56
     let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
 
     const lineHeights = wordSizes.map(size => size * 1.2);
-    const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
+    const totalHeight = lineHeights.reduce((sum, h) => sum - h, 0);
 
     let scale = 1;

[Survived] ArrowFunction
routes/generator/generate_info.js:76:44
     let wordSizes = words.map(word => Math.max(minFont, maxFont - word.length * 5));
 
     const lineHeights = wordSizes.map(size => size * 1.2);
-    const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
+    const totalHeight = lineHeights.reduce(() => undefined, 0);
 
     let scale = 1;

[Survived] EqualityOperator
routes/generator/generate_info.js:79:9
     const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
 
     let scale = 1;
-    if (totalHeight > height * 0.9) {
+    if (totalHeight >= height * 0.9) {
         scale = (height * 0.9) / totalHeight;
         wordSizes = wordSizes.map(size => size * scale);

[Survived] EqualityOperator
routes/generator/generate_info.js:79:9
     const totalHeight = lineHeights.reduce((sum, h) => sum + h, 0);
 
     let scale = 1;
-    if (totalHeight > height * 0.9) {
+    if (totalHeight <= height * 0.9) {
         scale = (height * 0.9) / totalHeight;
         wordSizes = wordSizes.map(size => size * scale);

[NoCoverage] ArithmeticOperator
routes/generator/generate_info.js:80:17
 
     let scale = 1;
     if (totalHeight > height * 0.9) {
-        scale = (height * 0.9) / totalHeight;
+        scale = height * 0.9 * totalHeight;
         wordSizes = wordSizes.map(size => size * scale);
     }

[NoCoverage] ArithmeticOperator
routes/generator/generate_info.js:80:18
 
     let scale = 1;
     if (totalHeight > height * 0.9) {
-        scale = (height * 0.9) / totalHeight;
+        scale = (height / 0.9) / totalHeight;
         wordSizes = wordSizes.map(size => size * scale);
     }

[NoCoverage] ArrowFunction
routes/generator/generate_info.js:81:35
     let scale = 1;
     if (totalHeight > height * 0.9) {
         scale = (height * 0.9) / totalHeight;
-        wordSizes = wordSizes.map(size => size * scale);
+        wordSizes = wordSizes.map(() => undefined);
     }
 

[NoCoverage] ArithmeticOperator
routes/generator/generate_info.js:81:43
     let scale = 1;
     if (totalHeight > height * 0.9) {
         scale = (height * 0.9) / totalHeight;
-        wordSizes = wordSizes.map(size => size * scale);
+        wordSizes = wordSizes.map(size => size / scale);
     }
 

[Survived] ArrowFunction
routes/generator/generate_info.js:84:47
         wordSizes = wordSizes.map(size => size * scale);
     }
 
-    const adjustedLineHeights = wordSizes.map(size => size * 1.2);
+    const adjustedLineHeights = wordSizes.map(() => undefined);
     const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
     let y = (height - adjustedTotalHeight) / 2;

[Survived] ArithmeticOperator
routes/generator/generate_info.js:84:55
         wordSizes = wordSizes.map(size => size * scale);
     }
 
-    const adjustedLineHeights = wordSizes.map(size => size * 1.2);
+    const adjustedLineHeights = wordSizes.map(size => size / 1.2);
     const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
     let y = (height - adjustedTotalHeight) / 2;

[Survived] ArithmeticOperator
routes/generator/generate_info.js:85:72
     }
 
     const adjustedLineHeights = wordSizes.map(size => size * 1.2);
-    const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
+    const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum - h, 0);
     let y = (height - adjustedTotalHeight) / 2;
 

[Survived] ArrowFunction
routes/generator/generate_info.js:85:60
     }
 
     const adjustedLineHeights = wordSizes.map(size => size * 1.2);
-    const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
+    const adjustedTotalHeight = adjustedLineHeights.reduce(() => undefined, 0);
     let y = (height - adjustedTotalHeight) / 2;
 

[Survived] ArithmeticOperator
routes/generator/generate_info.js:86:13
 
     const adjustedLineHeights = wordSizes.map(size => size * 1.2);
     const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
-    let y = (height - adjustedTotalHeight) / 2;
+    let y = (height - adjustedTotalHeight) * 2;
 
     ctx.fillStyle = '#fff';

[Survived] ArithmeticOperator
routes/generator/generate_info.js:86:14
 
     const adjustedLineHeights = wordSizes.map(size => size * 1.2);
     const adjustedTotalHeight = adjustedLineHeights.reduce((sum, h) => sum + h, 0);
-    let y = (height - adjustedTotalHeight) / 2;
+    let y = (height + adjustedTotalHeight) / 2;
 
     ctx.fillStyle = '#fff';

[Survived] StringLiteral
routes/generator/generate_info.js:89:21
     let y = (height - adjustedTotalHeight) / 2;
 
     ctx.fillStyle = '#fff';
-    ctx.textAlign = 'center';
+    ctx.textAlign = "";
 
     for (let i = 0; i < words.length; i++) {

[Timeout] UpdateOperator
routes/generator/generate_info.js:91:39
     ctx.fillStyle = '#fff';
     ctx.textAlign = 'center';
 
-    for (let i = 0; i < words.length; i++) {
+    for (let i = 0; i < words.length; i--) {
         const word = words[i];
         const size = wordSizes[i];

[Survived] EqualityOperator
routes/generator/generate_info.js:91:21
     ctx.fillStyle = '#fff';
     ctx.textAlign = 'center';
 
-    for (let i = 0; i < words.length; i++) {
+    for (let i = 0; i <= words.length; i++) {
         const word = words[i];
         const size = wordSizes[i];

[Survived] ArithmeticOperator
routes/generator/generate_info.js:95:28
         const word = words[i];
         const size = wordSizes[i];
         ctx.font = `bold ${size}px "Sans"`;
-        ctx.fillText(word, width / 2, y + size); 
+        ctx.fillText(word, width * 2, y + size); 
         y += size * 1.2;
     }

[Survived] ArithmeticOperator
routes/generator/generate_info.js:95:39
         const word = words[i];
         const size = wordSizes[i];
         ctx.font = `bold ${size}px "Sans"`;
-        ctx.fillText(word, width / 2, y + size); 
+        ctx.fillText(word, width / 2, y - size); 
         y += size * 1.2;
     }

[Survived] ArithmeticOperator
routes/generator/generate_info.js:96:14
         const size = wordSizes[i];
         ctx.font = `bold ${size}px "Sans"`;
         ctx.fillText(word, width / 2, y + size); 
-        y += size * 1.2;
+        y += size / 1.2;
     }
 

[Survived] AssignmentOperator
routes/generator/generate_info.js:96:9
         const size = wordSizes[i];
         ctx.font = `bold ${size}px "Sans"`;
         ctx.fillText(word, width / 2, y + size); 
-        y += size * 1.2;
+        y -= size * 1.2;
     }
 

[Killed] StringLiteral
routes/generator/generate_info.js:99:68
         y += size * 1.2;
     }
 
-    const outputDir = path.join(process.cwd(), 'public', 'covers', `${seed}_${page}`);
+    const outputDir = path.join(process.cwd(), 'public', 'covers', ``);
     await fs.mkdir(outputDir, { recursive: true });
 
killedBy: generateInfo Image generation should create image with correct directory structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- StringContaining "public\\covers\\456_7",
+ "C:\\Users\\justa\\Documents\\0x\\Stud\\4th1st\\PSK\\Laborai\\3\\fake_data_app\\.stryker-tmp\\sandbox-jxFawA\\public\\covers",
  {"recursive": true},

[Killed] BooleanLiteral
routes/generator/generate_info.js:100:44
     }
 
     const outputDir = path.join(process.cwd(), 'public', 'covers', `${seed}_${page}`);
-    await fs.mkdir(outputDir, { recursive: true });
+    await fs.mkdir(outputDir, { recursive: false });
 
     const fileName = `cover_${Date.now()}.jpg`;
killedBy: generateInfo Image generation should create image with correct directory structure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "C:\\Users\\justa\\Documents\\0x\\Stud\\4th1st\\PSK\\Laborai\\3\\fake_data_app\\.stryker-tmp\\sandbox-jxFawA\\public\\covers\\456_7",
  Object {
-   "recursive": true,

[Survived] ObjectLiteral
routes/generator/generate_info.js:104:64
 
     const fileName = `cover_${Date.now()}.jpg`;
     const filePath = path.join(outputDir, fileName);
-    await fs.writeFile(filePath, canvas.toBuffer('image/jpeg', { quality: 0.9 }));
+    await fs.writeFile(filePath, canvas.toBuffer('image/jpeg', {}));
 
     return `/covers/${seed}_${page}/${fileName}`;
